OpenFoam/validation1rod/P1-Model/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  P1;

fvDOMCoeffs
{
    nPhi        10;          // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta      10;          // polar angles in PI (from Z to X-Y plane)
    convergence 1e-5;       // convergence criteria for radiation iteration
    maxIter     10;         // maximum number of iterations
    cacheDiv    false;
}

// Number of flow iterations per radiation iteration
solverFreq 10;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
    absorptivity    absorptivity    [ 0 -1 0 0 0 0 0  ]     1E-10;
    emissivity      emissivity      [ 0 -1 0 0 0 0 0  ]     1E-10;
    E               E   			[ 1 -1 -3 0 0 0 0 ] 	0;
}

scatterModel    none;

// ************************************************************************* //
